Revit 2027 API
AnalysisDisplayLegendSettings.NumberOfSteps Property
 Number of steps (values between minimum and maximum) to be shown in legend.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int NumberOfSteps { get; set; }
Public Property NumberOfSteps As Integer
	Get
	Set
public:
property int NumberOfSteps {
	int get ();
	void set (int value);
}
member NumberOfSteps : int with get, set
Property Value
Int32
Exceptions
Exception | Condition
ArgumentsInconsistentException |  When setting this property: numberOfSteps is greater than 1000 or less than 0
See Also
Reference
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace